
// დავალება 2

// 1. თითოეულ ელემენტს მხოლოდ ერთი აიდი უნდა ქონდეს და არ შეიძლება სხვადასხვა ელემენტზე ერთი და იგივე აიდის გამოყენება.
//    აბრუნებს მხოლოდ ერთ ელემენტს.

// 2. აბრუნებს სიის სახით, შეიძლება ბევრ ელემენტს ქონდეს ერთი და იგივე კლასი და ამიტომ აბრუნებს რამდენიმე ელემენტს.
//    თითოეულზე წვდომა ხდება ინდექსით. [0], [1], [2] ... 

// 3. ასევე აბრუნებს სიის სახით, თაგნეიმი აღნიშნავს HTML-ის თაგს და შეგიძლია რამდენიმე თაგი ერთდროულად აიღო.



// დავალება 3

// 1. innerText - აბრუნებს ან ცვლის ელემენტის ტექსტს. ვერ კითხულობს დამალულ ტექსტს. გამოიყენება, როდესაც გინდა ნაჩვენები ტექსტის ჩანაცვლება.

// 2. textContent - აბრუნებს ან ცვლის ელემენტის ტექსტს. მაგრამ HTML- ის თეგებს ვერ კითხულობს, თუ ჩაწერ რამე თეგს, იგი აღიქვამს როგორც ტექსტი, და არა თეგი.

// 3. innerHTML - შესაძლებელია HTML - ის კოდების ჩაწერა, და შეუძლია აღქმა. გამოიყენება, როდესაც გინდა JS- ში HTML - ის სტრუქტურის ჩასმა. 
//    თუ შიგთავსს შეცვლი, მთელი სტრუქტურა იშლება.



