// 1) კომენტარებით ახსენით, რა არის scope JavaScript-ში, მოიყვანეთ მაგალითები

// scope არის კოდის ბლოკის გარკვეული არეალი


// 2) კომენტარებით ახსენით, რა არის hoisting-ი

// hoisting არის ფუნქციების, ცვლადების და კლასების დეკლარაციის კოდის ზემოთ ატანა

// 3) ახსენით რატომ არის ცუდი var ის გამოყენება

// var ცუდი გამოსაყენებელია, რადგან ძალიან მარტივად არის შესაძლებელი მისი რედეკლარაცია


// 4) ახსენით რა განსხვავებაა აროუ ფუნქციასა და ჩვეულებრივ ფუნქციის შორის

// სხვადასხვანაირი სინტაქსი, arrow function - ში გამოიყენება '=>' , ჩვეულებრივი ფუნქცია - functio (){}
